import React from "react";
import { SenderCell, NotificationTitle, NotificationDesc } from "./styled";

const IconLetter = () => (
  <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
    <path d="M6.06458 13.6423C7.35824 13.6748 8.63916 13.6748 9.93282 13.6423C12.0318 13.5896 13.0813 13.5632 13.8354 12.8062C14.5895 12.0493 14.6113 11.0274 14.6549 8.98375C14.6689 8.32663 14.6689 7.67338 14.6549 7.01626C14.6248 5.6084 14.6052 4.68547 14.3493 4L7.9987 7.33333L1.6481 4C1.39224 4.68547 1.37256 5.6084 1.34254 7.01625C1.32853 7.67338 1.32853 8.32662 1.34254 8.98375C1.38613 11.0274 1.40792 12.0493 2.162 12.8062C2.91609 13.5632 3.96559 13.5896 6.06458 13.6423Z" fill="#848380" fillOpacity="0.2" />
    <path d="M9.93315 2.35763C8.63949 2.32513 7.35857 2.32513 6.06491 2.35763C3.96592 2.41036 2.91642 2.43673 2.16233 3.19368C1.92772 3.42919 1.76399 3.69034 1.64844 3.99992L7.99903 7.33325L14.3496 3.99992C14.2341 3.69034 14.0703 3.4292 13.8357 3.19369C13.0816 2.43674 12.0322 2.41037 9.93315 2.35763Z" fill="white" />
    <path d="M1.33203 4L5.94071 6.61131C7.63976 7.57401 8.35763 7.57401 10.0567 6.61131L14.6654 4" stroke="#848380" strokeWidth="1.5" strokeLinejoin="round" />
    <path d="M1.34254 8.98367C1.38613 11.0274 1.40792 12.0492 2.162 12.8062C2.91609 13.5631 3.96559 13.5895 6.06458 13.6422C7.35824 13.6747 8.63916 13.6747 9.93282 13.6422C12.0318 13.5895 13.0813 13.5631 13.8354 12.8062C14.5895 12.0492 14.6113 11.0274 14.6549 8.98367C14.6689 8.32654 14.6689 7.6733 14.6549 7.01618C14.6113 4.97249 14.5895 3.95065 13.8354 3.19369C13.0813 2.43674 12.0318 2.41037 9.93282 2.35763C8.63916 2.32513 7.35824 2.32513 6.06458 2.35763C3.96558 2.41036 2.91609 2.43673 2.162 3.19368C1.40791 3.95064 1.38612 4.97248 1.34254 7.01617C1.32853 7.6733 1.32853 8.32654 1.34254 8.98367Z" stroke="#848380" strokeWidth="1.5" strokeLinejoin="round" />
  </svg>
);

export const columns = [
  {
    title: "Người chuyển",
    dataIndex: "nguoiChuyen",
    key: "nguoiChuyen",
    width: "30%",
    align: "center",
    render: (text) => (
      <SenderCell>
        <IconLetter />
        {text}
      </SenderCell>
    ),
  },
  {
    title: "Thông báo",
    dataIndex: "thongBao",
    key: "thongBao",
    render: (item) => (
      <div>
        <NotificationTitle href="#">{item.title}</NotificationTitle>
        <NotificationDesc>{item.desc}</NotificationDesc>
      </div>
    ),
  },
];

export const tableProps = {
  columns,
  pagination: false,
  bordered: true,
  size: "small",
  scroll: { x: 400 },
};
